package com.rsschool.quiz

object Content {
    val questions: List<Question> = listOf(
        Question("В какой стране, и в каком городе проходил Финал Клубного чемпионата мира по футболу 2019?",
        listOf("Иокогама (Япония)",
            "Абу-Даби (ОАЭ)",
            "Лондон (Англия)",
            "Доха (Катар)",
            "Кривой Рог (Украина)"),
            3),

        Question("Кто стал победителем ФИФА 2019?",
        listOf("Фламенго (Франция)",
            "Бавария (Германия)",
            "Ливерпуль (Англия)",
            "Манчестер Юнайтед (Англия)",
            "Шахтер (Украина)"),
            2),

        Question("Кто признан лучшим вратарём в 2019 году по версии ФИФА?",
        listOf("Алиссон из «Ливерпуля»",
            "Тибо Куртуа из «Реала»",
            "Ян Облак из «Атлетико»",
            "Давид де Хеа из «Манчестер Юнайтед»",
            "Джанлуиджи Буффон из «Ювентуса»"),
            0),

        Question("Кто является лучшим бомбардиром за всю историю сборной Португалии?",
        listOf("Матийс де Лигт",
            "Криштиану Роналду",
            "Лионель Месси",
            "Вирджил ван Дейк",
            "Бернарду Силва"),
        1),

        Question("Как называется гол, который футболист забил в свои ворота?",
        listOf("Штрафной",
            "«Мертвый мяч»",
            "Автогол",
            "Ложный маневр",
            "Кожаный мяч"),
        2),
    )
}